module.exports.config = {
    name: 'autosend',
    version: '2.0.4',
    hasPermssion: 2,
    credits: 'đtai',
    description: 'Tự động gửi tin nhắn theo giờ đã cài!',
    commandCategory: 'Hệ thống',
    usages: '[]',
    cooldowns: 3
};
const r = a => a[Math.floor(Math.random()*a.length)],
{
    get
} = require('axios'),
config = [{
        timer: '12:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
          {
        timer: '12:30:00 AM',
    message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '11:00:00 AM',
    message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '11:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '10:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '10:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '9:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '9:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
          {
    timer: '8:00:00 AM',
    message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '8:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{ 
        timer: '7:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{ 
        timer: '7:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '6:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '6:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '5:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '5:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '4:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '4:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '3:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '3:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '2:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '2:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '1:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '1:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{ 
        timer: '11:00:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '11:30:00 AM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '12:00:00 PM',
    message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '12:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '1:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '1:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '2:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '2:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '3:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '3:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '4:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '4:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '5:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '5:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '6:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '6:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '7:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '7:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '8:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '8:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '9:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '9:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '10:00:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
},
{
        timer: '10:30:00 PM',
        message: ['====「 𝐀𝐔𝐓𝐎 𝐂𝐀̂𝐔 𝐓𝐇𝐈́𝐍𝐇 」 ====\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱\n⏰𝗧𝗶𝗺𝗲: {gio}\n————————————————————\n💞𝐂𝐚̂𝐮 𝐭𝐡𝐢́𝐧𝐡: {thinh}\n————————————————————\n❤️𝐂𝐡𝐮́𝐜 𝐛𝐚̣𝐧 𝐭𝐚́𝐧 𝐝𝐨̂̉ 𝐜𝐫𝐮𝐬𝐡 𝐭𝐡𝐚̀𝐧𝐡 𝐜𝐨̂𝐧𝐠\n▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱▱']
      }];
module.exports.onLoad = o => {
    if (!!global.autosendmessage_setinterval) clearInterval(global.autosendmessage_setinterval);
    global.autosendmessage_setinterval = setInterval(async function() {
        if (á = config.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) {

            var msg = r(á.message);
            msg = msg.replace(/{gio}/g, (require("moment-timezone")).tz("Asia/Ho_Chi_Minh").format("HH:mm:ss (D/MM/YYYY) (dddd)")).replace(/{thinh}/g, (await get(`https://apivip.nguyenlienmanh.com/text/thinh`)).data.data)
            msg = {
                body: msg , attachment: (await get((await get(`https://api.apibot.repl.co/gai`)).data.data, {
                    responseType: 'stream'
                })).data
            };
            global.data.allThreadID.forEach(i => o.api.sendMessage(msg, i));
        };
    }, 1000);
};
module.exports.run = () => {};